# У цьому файлі міститься скрипт гри.

# Оголошення персонажів, які використовуються в цій грі. Колірний аргумент розфарбовує
# ім’я персонажа.

define St = Character("Стефан")
define Iv = Character("Ів")
define Of = Character("Офіціант")


default cringe_points = 0
default luck_points = 0
default drunk_points = 0

label start:
    jump intro


label change_cringe_points(value):
    $ cringe_points = cringe_points + value
    if cringe_points >= 10 :
        jump the_end_cringe
    else:
        return

label change_luck_points(value):
    $ luck_points = luck_points + value
    return


label change_drunk_points(value):
    $ drunk_points = drunk_points + value
    return


label drink_menu:
    menu:
        "Пиво":
            call change_drunk_points(+5)
        "Шампанське":
            call change_drunk_points(+5)
        "Мартіні":
            call change_drunk_points(+10)
        "Коньяк":
            call change_drunk_points(+10)
        "Чай":
            pass
    return



label intro:


    "Ох, щось я трохи хвилююсь."
    "Так, потрібно терміново опанувати себе!"
    "Добре-добре. Фу-у-ух, видихаєм…"
    
    "Що ж вдягти? Це? Чи це? Чи може це?"
    "Поголитись? Гм…"
    "Викликати таксі, чи доїхати на метро?"
    "Чи варто подзвонити перед виходом?"
    "Щось я хвилююсь… Я ж вже це казав, вірно?"
    "Ой, а котра година?"
    "Все, пора виходити."
    "Чекаю на нашу зустріч понад усе."


    jump chapter1


label chapter1:
    St "Який сьогодні гарний день. Не для вампірів, але я впевнений, Іву буде приємно прогулятись по вулиці."
    "Сонце в зеніті і ти пришвидшуєш крок, ховаючись від нього під просторою парасолею."
    "Ти повільно підходиш до невеликого і дуже затишного ресторану, у якому через кілька хвилин повинна початись приємна зустріч."
    "Людей всередині майже нема, але це і не дивно: робочий день ще не закінчився, та і район насправді не дуже популярний."
    "Серед людей, звісно."

    # Ілюстрація бек: заходить всередину



    "Ти заходиш всередину ресторану і сідаєш за столик подалі від дверей, барної стійки та приміщення для персоналу."
    St "Сподіваюсь, йому теж тут сподобається."
    St "Що ж, скоро побачимо."
    "Ти даєш зрозуміти офіціанту, що ще чекаєш на свого супутника і щохвилини дивишся на екран телефона, сподіваючись пришвидшити час."
    "На жаль чи на щастя, без спеціалізованих знань зробити це майже неможливо."
    "…"
    "Час потроху спливає і ти починаєш трохи нервуватись."
    "Ів попереджав, що може трохи затриматись на роботі, і ти заспокоюєш себе думкою, що саме так і сталося."
    "Він просто затримується на десять хвилин, Стефане."
    "Просто набридливий клієнт ніяк не покладе слухавку і не відпустить його по своїм справам."
    "Це ще навіть не запізнення, якщо так подумати."
    "…"
    "Він же не міг забути?"
    "Чи ще гірше – свідомо не прийти?"

    Iv "Як сталось, що такий гарний упирчик сидить в цьому кафе один і зовсім без охорони?"
    Iv "Не боїшся, що вкрадуть?"
    St "І тобі привіт."
    Iv "Все добре?"
    St "Просто я не очікував від тебе такого привітання."
    Iv "Так як я трохи запізнився, то вирішив діяти несподівано, щоб ти на мене не бурчав."
    St "Нічого страшного. У тебе щось сталось?"
    Iv "Мене зупинила поліція і допитувала протягом години. "
    St "Жах! Чому саме тебе?"
    Iv "Вони шукають найкрасивішого мужчину в усьому Парижі, але ти можеш бути спокійним: я тебе не видав."
    St "…"
    Iv "Я знав, що ти оціниш."
    St "Хіба на трієчку з п’яти. Заснув на книжці з жахливими фразами для знайомств?"
    Iv "Скоріше за роботою."
    St "Її настільки багато?"
    Iv "Ох."
    Iv "Знаєш, я колись дивився документальний фільм про адронний колайдер. І у ньому працівник скаржився на те, що «полагодили одне – зламалось інше. Полагодили інше – потекла якась труба. Полагодили трубу – посипалась стіна». І так до безкінечності."
    Iv "У мене зараз настрій приблизно як у того мужика."
    St "Маю надію, що до кінця вечора мені вдасться його покращити."
    Iv "Побачимо."
    Iv "Бо вже нема сил."
    Iv "Іве, подзвони йому! Іве, він чекає на правки! Іве, а де файл?"
    Iv "А Ів навіть кави не встиг випити."
    St "Моя ж ти бідося."
    St "Чи можу я тебе якось розрадити?"

    menu:
        "Ти голодний?":
            pass

    Iv "Так, я б зараз цілого кабана з’їв, якщо чесно."
    St "Наскільки я пам’ятаю, у них смачні стейки."
    Iv "Стейки, кажеш?"

    # Десть тут після вибору вище треба додати ілюстрацію меню на весь екран. Якщо вдасться зробити його клікабельним – буде шикарно, ні – додати великоток на станди з Джоджо/персонажів-пончиків з ВП і ДД
    # (Ілюстрація Ів трохи в ахуї – далі 10% сором)
    call change_cringe_points(+1)


    Iv "От його і візьму."
    St "Алкоголь?"
    Iv "Ну…"

    $ choosen_drink = ""

    menu: 
        "Так":
            Iv "Ой, так, хочу. Бо це був якийсь день відкритих дверей в дурдомі."
            St "Замов собі…"
            call drink_menu
            Iv "Мені подобається. Саме те, що зараз потрібно."

        "Ні":
            pass


    "Офіціант швидко записує ваше замовлення і знову залишає вас наодинці."
    Iv "Уф… Мабуть, варто закінчити з цим замовником і піти у невелику відпустку."
    St "І як ти будеш відпочивати?"
    St "Будеш весь час читати книги і гуляти, чи кудись поїдеш?"
    Iv "Це залежить не лише від мене."
    St "В якому сенсі?"
    Iv "Якщо один підстаркуватий упирчик зацікавиться спільним відпочинком, тоді, скоріш за все, я кудись поїду."
    St "…"
    St "Можливо, він зацікавиться."
    Iv "Я так і подумав."
    St "І куди ти хочеш з’їздити?"
    Iv "Куди?.."
    Iv "Було б гарно побувати десь у горах. Десь, де тихо, ліс, одинока хатинка, озеро і навколо зовсім нікого, крім нас."


    menu:
        "Мені подобається":
            call change_luck_points(+5)
        "Це не мій тип відпочинку":
            call change_luck_points(-5)
            Iv "Шкода. Я люблю такий відпочинок на природі."
            Iv "Ну… Розумієш… Там так гарно і тихо."
            Iv "І… і вовку завжди є де побігати..."
            Iv "Він… Я люблю таке усамітнене і затишне… хм… лігво."


    Iv "А ще можна побувати десь на морі чи океані!"
    Iv "Уяви: усамітнений пляж. Ми сидимо на піщаному березі під зонтиком, і хвилі безкінечно накочуються і відступають."
    Iv "І чайки в небі голосно кричать."
    Iv "І пахне сіллю. І морозивом, яке у мене в руках."
    Iv "Чому ти з мене смієшся?!"
    St "Це дуже мило."
    Iv "А ти на спеці випадково не розтанеш, як у тих стрьомних історіях про вампірів?"
    St "Хіба у твоїх обіймах."
    Iv "…"
    Iv "Це навряд. Якщо я вже за щось чи за когось схопився, то від мене просто так не вислизнеш."
    St "Обов’язково перевірю."
    Iv "А ти де любиш відпочивати?"
    St "Мені теж імпонує бути десь, де тихо і немає людей."
    St "Найчастіше я знаходжу якесь непопулярне місце за допомогою Інтернету і їду туди."
    Iv "Я думаю, всі ці місця не просто так непопулярні."
    St "Ну… Не завжди. Можу знайти тобі фото останнього відпочинку, якщо даси кілька хвилин."
    Iv "Ой, ну ні! Ніяких телефонів, поки ми тут."
    St "Добре-добре, я просто спитав."
    Iv "І де ти був?"
    St "Часто якісь кряжі, гірські дороги, забуті розвалини. І…"
    Iv "…"
    Iv "Що?"
    St "Можеш не стримувати себе."
    St "І печери."
    Iv "…"
    Iv "…"
    Iv "Я аж не знаю, з якого жарту почати."
    St "Та вже вибери якийсь."
    Iv "Потягнуло до родичів?"
    St "Хто знає. Природа вампірів до кінця ще не вивчена."
    St "Але якщо серйозно, то під час першої нашої поїздки у нетуристичну печеру ми заблукали і натрапили на купу кажанів, які спали під стелею."
    Iv "Ого! А ти можеш з ними спілкуватись? Ну, розумієш їх?"
    St "Отак тобі всі таємниці і розкажи на першому побаченні."
    Iv "Цікаво же."
    St "Відповім так: нам вдалось розбудити ту колонію і вона допомогла нам вибратись з печери."
    Iv "Вау! Тобто, це не казочки? Ти їм наказав провести вас до виходу?"
    St "Хм… Може і наказав, але обгидили нас вони явно з власної волі."
    Iv "Кажуть, то до грошей."
    St "До грошей то голуби. А це до великого прання."
    Iv "До речі, ти сказав «ми». Ти там був з друзями?"
    St "Ні."

    # Ілюстрація Іва з вушками - зацікавлено
    Iv "А з ким?"
    St "З хлопцем. Колишнім."
    # Ілюстрація Іва з вушками – розібратись по ходу


    Iv "Теж любив ходити там, де нога нормального нелюда не ступала?"
    St "Не дуже, але на кілька годин кудись вирватись був не проти."
    Iv "Я б теж не дуже хотів блукати невідомими печерами, якщо чесно."
    St "Так я ж і не тягну тебе."


    menu:
        "Поки що":
            call change_luck_points(+5)
        "Промовчати":
            call change_luck_points(-5)

    Iv "О, а ось і наше замовлення!"
    # Показати перехід через ds
    "Кілька хвилин ви сидите мовчки, вгамовуючи перший голод."
    Iv "Ох!"
    Iv "Смачно."
    Iv "Навіть настрій покращився."
    St "Я радий. Це було неважко."
    Iv "А як ти зазвичай справляєшся з поганим настроєм?"
    Iv "Типу, чи є у тебе якісь особисті прийоми?"
    St "Дай подумати."
    Iv "Даю."
    St "Я насправді рідко маю кепський настрій. А от що допомагає…"
    St "Хм…"
    St "Точно рятує спілкування з близькою людиною. Кілька хвилин – і я забуваю, через що сумував."
    St "Ще можу відволіктись на щось, приготувати вечерю для когось чи подивитись якийсь цікавий ролик в інтернеті."
    Iv "Тобто відправлена у правильний момент хтивка виконає відразу дві задачі і підніме ще й настрій?"
    Iv "Запам’ятаю."
    St "…"
    St "Головне, щоб настрій підіймався тільки у мене, а не у людей поруч."
    Iv "Ну, це вже будуть не мої проблеми."
    Iv "Це ти соромишся, що хтось побачить такі фото, чи ревнуєш?"

    menu:
        "Соромлюсь":
            call change_cringe_points(+2) 
        "Ревную":
            pass


    Iv "…"
    Iv "Ти такий милий."
    Iv "Ти завжди такий милий?"
    St "…"
    # Ілюстрація Ів сильно усміхається
    St "…"
    St "Тільки коли сплю зубами до стіни і не кусаюсь."
    Iv "І в яких випадках ти найчастіше кусаєшся?"
    St "Все тобі потрібно знати."
    Iv "Ну я ж перевертень, я люблю все… винюхувати."
    Iv "То коли?"

    menu:
        "Тільки коли мені хтось дуже подобається":
            call change_cringe_points(+2)
            Iv "І коли мені пора починати переживати?"
            St "В сенсі?"
            Iv "Ми сидимо в цьому ресторані вже сто років, а я досі некусаний."
            # Ілюстрація Ів притворно розстроюється
            St "Я… Не при всіх же."
            Iv "А як же всі ті упущені можливості, коли ми годинами ходили тими тихими темними вуличками Парижа?"
            Iv "То ж святе, хапай і кусай!"
            St "Я ж не маніяк якийсь."
            # Ілюстрація Ів з вушками
            Iv "Шкода."

        "Коли хтось дуже довго пробиває товар на касі супермаркета":
            Iv "А-ха-ха-ха! Я б тебе після першого ж разу не пускав у магазин."
            Iv "Або виділив би окрему касу. Для найнетерплячіших."
            St "Нас і так багато хто відділяє від основної маси."
            Iv "Воно і не дивно, якщо тебе кусають за дупу, поки ти зважуєш собі моркву на обід."

    Iv "Гей, ти чого?"
    Iv "Я ж пожартував."
    St "Пробач. Раптом згадались всі спроби суспільства якимось чином від мене відгородитись і стало сумно."
    Iv "Я щось не подумав."
    Iv "…"
    Iv "То з мене хтивка?"

    Of "Бажаєте ще щось?"


    "Офіціант, здається, з’являється біля вас нізвідки."
    "Ів здригається від несподіванки, але до твого здивування утримується від незадоволеного тону."
    Iv "Я, мабуть, візьму ще…"

    call drink_menu

    
    St "Мені теж ще один келих, будь ласка."
    "Офіціант записує ваше замовлення і за кілька хвилин приносить його."
    "Кілька хвилин ви сидите мовчки, думаючи про щось своє."
    Iv "…"
    Iv "Хм."
    Iv "Стефане, я можу спитати?"
    St "М-м-м?"
    St "Що саме?"
    Iv "Наскільки…"
    Iv "Тебе сильно обтяжує бути вампіром?"

    menu:
        "Сильно":
            call change_luck_points(-5)
        "Не дуже":
            call change_luck_points(+5)


    St "Я приблизно чогось такого і очікував правду кажучи."
    St "Тому скажу так: є свої недоліки, але жити можна."
    St "До упередженого ставлення з часом звикаєш і майже не звертаєш на нього увагу."
    St "Поки не прилетить. В усіх сенсах."
    St "Важче було звикнути до нового… хм, раціону…"
    St "Якийсь час все ще хотілось купити і з’їсти улюблені продукти, але за тиждень-два зникло і це бажання."
    St "Ще довелось звикати до відсутності запрошувачів у деяких магазинах."
    St "Іноді забував, що краще не виходити на сонце, але і це дрібниці. Почав більше гуляти ввечері та і все."
    St "Мабуть, найгірше з усіх наслідків це постійно холодне тіло, але то вже не моя проблема."
    St "Тому ні, мене не сильно обтяжує бути вампіром."
    Iv "Ти так легко погоджуєшся з обмеженнями."
    Iv "Сказав би хтось мені, що не можна бігати по сонцю! Відразу ж хочеться вийти кудись на пляж і розлягтись зірочкою на піску."
    Iv "Чого ти смієшся? У мене аж руки зачухались прямо зараз так і зробити."
    St "Не знав, що ти такий бунтар."
    Iv "Мені у дитинстві, а особливо протягом підліткового віку, взагалі неможливо було щось заборонити."
    Iv "Тобто, ну, можна було, але я з тим був категорично незгоден!"
    St "Бідні твої батьки."
    Iv "Як сказати."
    Iv "Я, хоч і протестував, але слухався."
    St "Здається, зараз майже нічого не змінилось."
    St "…"

    # Ілюстрація Ів сильно усміхається
    Iv "Тобто?"
    St "…"
    St "…"
    Iv "Та кажи вже."

    menu:
        "Ти досі іноді слухаєшся старших?":
            call change_cringe_points(+2)
            call change_luck_points(+5)

    # Ілюстрація Ів сильно усміхається через паузу /2р

    Iv "…"
    Iv "Хочеш перевірити?"
    Iv "Для тебе, мій любий упирчику, я готовий бути і слухняним хлопчиком, і розпусним розбишакою."
    Iv "І це все за одну ніч."
    St "Кхм…"
    St "Щось я… хм…"
    Iv "Я вже казав, що ти дуже милий, коли соромишся?"
    St "Сто разів."
    Iv "Отже."
    Iv "Ти любиш ігри?"
    St "Що?"
    St "Ігри?"
    St "Трохи неочікуване питання, якщо чесно."
    St "Гм…"
    St "Ти про про які ігри питаєш? Комп’ютерні? Чи настільні?"
    Iv "Настільні."
    St "Ой, дивлячись які."
    St "Кілька разів пробував грати, було навіть цікаво. Згадати б назву…"
    St "Головне щоб процес не затягувався надовго."
    St "…"
    Iv "…"
    St "Чого ти?"
    Iv "Я теж люблю настільні ігри."
    Iv "Зіграємо?"
    St "О боги…"
    Iv "Розкладеш мене прямо тут на столі?"
    St "…"
    St "Іве…"
    St "Ти на якісь дурнуваті курси зваблення записався?"
    Iv "Ображаєш! Писав дещо по роботі, от і увібрав у себе нові корисні знання."
    Iv "Працює ж."
    Iv "А чого не любиш довго затягувати? Здоров’я вже не те?"
    St "Звісно, мені ж вже не вісімнадцять років. І пальці на погоду крутить, і щелепа при позіханні хрускає, і важкувато на п’ятий поверх пішки підійматись."
    St "Та і ціни на тих лікарів зараз такі, що треба себе берегти, бо ніякої зарплатні на них не вистачить. І страховок."
    Iv "Ой, не кажи."
    Iv "Я місяць тому прийшов до стоматолога спиляти ікло, бо щось дряпатись почало при перекиданні у вовка, а він як заглянув в мої глибини…"

    # Ілюстрація Ів з вушками сумний

    Iv "Може і самому цойгокнутись у вампіра, дешевше буде."
    Iv "Треба було зуби лікувати, поки батьки забезпечували, чесне слово."
    St "Знайомо. Але вже не актуально."
    Iv "Добре тобі!"
    St "Не жаліюсь."
    Iv "Нічого, буде колись і на тебе кара божа."
    St "Та, здається, її вже наслали."
    Iv "Пф. Це ти мене ще на повню не бачив. От тоді згоден, тоді гайки всім навколо."
    St "…"
    Iv "Не подобається?"
    St "Навпаки."
    Iv "Тобто ти не тільки любиш гратись, а ще й трохи мазохіст."
    Iv "Так і запишемо."
    St "До речі, про повню. Розкажи, як це відбувається у перевертнів."
    Iv "Що саме тебе цікавить?"
    St "Ти казав, що у вас є спеціальні місця, де можна побути вовком. Цікавить, як там все влаштовано."
    Iv "Ой, та насправді нічого цікавого."
    Iv "Кілька великих приміщень, де можна побігати, поспати, подряпати стіну, повити."
    Iv "Посоціалізуватись з іншими відвідувачами."
    Iv "Всередині все зроблено під ліс з галявинами, але як на мене це суцільний несмак."
    Iv "І синтетикою смердить. Ці пластикові голки на ялинках колись доведуть мене до сказу."
    Iv "Але то для таких невибагливих, як я. Є простори дорожчі, там тобі і осіннє листя розкидають, щоб на ньому повалятись, і води свіжої в джерело наллють."
    Iv "Якщо є бажання, тебе можуть погодувати чимось, що ти сам принесеш, або обереш з меню."
    St "А якщо це… хм… сезон спарювання?"
    Iv "Тоді або сиди вдома, або кімнати розділяють по статям та і все."
    Iv "Хоча це відчувається як якесь знущання насправді. Ніби тебе десь блоха кусає, а ти не можеш її вичесати з себе."
    St "А… хм…"
    Iv "Відчуваю якесь сороміцьке питання."
    St "Воно, мабуть, не зовсім коректне і занадто особисте."
    Iv "А от тепер стало ДУЖЕ цікаво. Питай, тобі можна."

    menu:
        "Тебе ж потрібно навпаки, ізолювати від чоловічої статі в такі періоди":
            call change_cringe_points(+2)
            call change_luck_points(+5)
            Iv "Ой, в такі моменти мені в мені скоріше прокидається бажання гризтись з усіма в тій кімнаті."
            Iv "Іноді так і стається. Але не з моєї ініціативи."

        "Та ні, залишу це питання на майбутнє":
            call change_luck_points(-5)
            Iv "Шкода, але тиснути не буду."
            Iv "Поки що."
    
    Iv "Ох, не люблю повню."
    Iv "Тобі і так погано, а ще треба кудись діти всю накопичену енергію. Бігаєш як дурний півтора дні, а потім відсипаєшся ще добу."
    Iv "І нікому ж не поясниш на роботі, що у тебе все життя згідно місячного календаря рухається, дедлайни ж не чекають."
    St "А можна якось цей період полегшити?"
    Iv "Ніяк. Хіба слухати моє скавчання, робити масаж, бо все тіло ломить, годувати курячими суглобами в три ночі."
    St "Я не проти."
    Iv "…"
    Iv "Сьогодні ж збираю речі."
    St "І багато їх у тебе?"
    St "Замовити вантажівку, чи і тачанкою обійдемось?"
    Iv "Не дуже і багато. Так, дві шафи з одягом, трохи творчого мотлоху, картини, книги, велосипед, кухонне приладдя, трохи непрацюючої техніки, яку треба віднести полагодити, сестрині штуки, які батьки не повинні ніколи побачити, трохи меблів, речі для моєї другої форми, три матраци, кілька штук для ванни…"
    Iv "Ну добре, не кілька, багато."
    Iv "В багажник має поміститись."
    St "Здається, нам треба буде зняти не квартиру, а цілий котедж."
    Iv "Було б гарно, але я вже підпиляв ікло, тож найближчі півроку я живу в коробці біля батьківської хати."


    # Звук вібрації 

    Iv "Ой, ну кому я вже потрібен?"
    Iv "Замовник. Цікаво, правки по тексту, чи спитає мій банківський рахунок?"

    menu:
        "Замовник може трохи почекати":
            call change_luck_points(+5)
        "Відповідай, це може бути терміново":
            jump the_end_2

    Iv "Маєш рацію. Нехай трохи почекає, і так весь день мозок виносив."
    Iv "…"
    St "Не згадуй роботу, вона зараз тут ні до чого."
    Iv "Мені важко перемикатись. Особливо коли був отакий день як сьогодні."
    St "До цього моменту тобі все вдавалось."
    Iv "Іноді я непоганий актор."
    St "Головне, щоб це не було на постійній основі."
    Iv "Не на постійній. Так, епізодично. Коли маю настрій."
    Iv "Можу побути твоїм песиком."
    Iv "А можу і хазяїном песика."
    Iv "Як тобі більше подобається? Любиш песиків?"(чи ти кошатник?)
    St "А раптом я не по песикам?"
    Iv "Отакої. Мене ще ніхто не кликав на побачення і не заявляв на ньому, що він не по песикам."
    Iv "Не по мужчинам – кожен третій так точно."
    Iv "Ні-ні, Іве, я не такий, я у мене взагалі дружина і двоє дітей, ага."
    Iv "Ой, вибач."
    Iv "Згадалась пара чортяк."
    St "Та нічого. І добре, що вони виявились такими чортяками, бо ми б зараз тут не сиділи."
    Iv "Твоя правда."
    St "Люблю песиків. Чесно."
    Iv "І шерсть за ними теж любиш прибирати?"
    St "І шерсть за ними обожнюю прибирати. І кігті стригти. І лапи мити. І слухати їх виття в три ночі."
    Iv "Дивлюсь на твоє багряне обличчя і не вірю, що у тебе низька температура тіла."
    Iv "Ти зараз згориш прямо посеред кафе."
    Iv "Давай я тебе доб’ю: можливо, я носій генів не тільки перевертня, а й медузи горгони."
    St "…"
    St "О боги…"
    # Ілюстрація Ів сильно усміхається
    Iv "Бо при погляді на мене у тебе таки щось скам’яніє."
    St "..."
    St "Рятуйте."
    Iv "Я ще й не починав."
    Iv "Але можу припинити."
    Iv "Як забажаєш, мій упирчику."

    menu:
        "Мені все подобається":
            call change_luck_points(+5)
        "Мені трохи… незручно":
            call change_luck_points(-5)

    Iv "Хех."
    Iv "Знаєш, до нашого знайомства я кілька разів звертав на тебе увагу в барі."
    St "Це було взаємно. Але тепер мені цікаво, якою була причина такого підвищеного інтересу до звичайного відвідувача."
    # Ілюстрація Ів трохи соромиться

    Iv "Ну…"
    Iv "Не важливо."
    Iv "Але мені завжди здавалось, що ти дуже самовпевнений і засоромити тебе - майже неможлива задача."
    St "Дивлячись коли."
    Iv "…"
    Iv "Упирчику, ти не уявляєш, як мені цікаво перевірити ВСІ варіанти."
    St "Можливо, тобі навіть вдасться. Колись."
    Iv "Я дуже терплячий."
    St "Я б так не сказав."
    Iv "Я знаю тебе довше ста годин, а досі не бачив тебе оголеним."
    Iv "Я. Дуже. Терплячий."
    St "Та не обманюй, я тобі висилав фото."
    Iv "Оте сонне біля дзеркала із зубною щіткою в роті?"
    Iv "Воно було миле, але навіть до рейтингу 16+ не дотягує."
    St "Я взагалі стараюсь не робити такий контент, якщо чесно."
    Iv "Оу."
    Iv "Чому?"
    St "Мені б не хотілось, щоб ці фото чи відео з’явились десь у мережі. Чи у роботодавця. Чи друзів."
    St "Та і на що там, правду кажучи, дивитись."
    St "Приходь в гості і дивись собі, а не оце все."
    Iv "…"
    Iv "У-у, це запрошення?"
    St "…"
    St "Якщо будеш себе гарно вести - покличу до себе на каву."
    Iv "Я хороший песик. Чесно-чесно. Особливо якщо мене файно попросити."
    St "Вірю. Весь ресторан тобі вірить."
    Iv "Весь ресторан хай не підслуховує. І не підглядає."
    Iv "Гм…"
    Iv "Це якщо саме я запрошу тебе до себе додому, то це Я повинен буду тобі щось показати?"

    menu:
        "Не обов’язково":
            call change_luck_points(-5)
            Iv "Мене вчили, що гостям дають найкраще."
            St "Якщо усіх так… гарно приймати, то ніяких… ресурсів не вистачить."
            Iv "Так і я не дуже гостинний."

        "Я б глянув, звідки у тебе хвіст росте":
            call change_luck_points(+5)
            call change_cringe_points(+2)
            Iv "Давай вийдемо у вбиральню, покажу."
            St "Та мені ж не шістнадцять років, щоб бігати у вбиральні за хлопцями і дивитись на їх… хвости."

    Iv "…"
    Iv "Що?"
    St "Маю так багато питань, але не впевнений, що хочу отримати на них відповіді прямо зараз."
    Iv "Тоді я відволічу тебе. Любиш приймати гостей вдома?"
    St "Гостей?"
    St "Дивлячись кого. Найбільше люблю влаштовувати посиденьки з найближчими друзями, але це вдається досить рідко."
    St "Сам розумієш, то у мене робота, то у них нирка заболіла, то племінники народжуються, то ще якась історія. Важко зібратись всім разом."
    Iv "А найменше?"
    St "Троюрідну тітку двоюрідної сестри мами, яку батькам обов’язково треба привезти з собою щоб показати, як я облаштувався."
    St "Добре, що їм теж важко зібратись разом."
    St "А ти?"
    Iv "Я не дуже люблю гостей, адже совість каже, що перед цим дійством треба поприбирати вдома, а мені зазвичай лінь цим займатись."
    Iv "Не подумай, там не гори сміття, але змахнути пилюку з поверхонь точно доведеться."
    Iv "Краще ходити в гості. Прийшов, посидів, соціалізувався, обмінявся останніми новинами, поїв, випив, пішов додому."
    Iv "Краса ж!"
    St "Якщо прийду я, то можеш не прибирати. Я не буду роздивлятись пилюку на твоїх поличках."
    Iv "Будемо її створювати, вибиваючи з матрацу на ліжку?"
    Iv "Чи навпаки, витремо власними тілами?"
    Iv "Чи виконаємо мою мрію і організуємо мені регулярний клінінг?"
    St "…"
    St "Краще йти в гості до мене."
    Iv "Але я ж ще той… песик. Один раз запросиш – ризикуєш більше не вигнати."
    Iv "Принаймні поки добряче не висплюсь."
    St "З цим проблем не має виникнути. Принаймні, ніхто не скаржився."
    Iv "А на мене – дуже навіть скаржились."
    St "Чому?"
    Iv "То похропую трошки, то посилаю замовника уві сні, то кручусь, то сіпаюсь."
    St "Які ніжні."
    Iv "От я теж так думаю."
    Iv "Хоча здавалось, що після моєї піжами з… хм… після моєї піжами не було чому дивуватись."
    St "Піжами з чим?"
    Iv "Колись покажу. То треба бачити."
    Iv "Сестра подарувала із коментарем «щоб любов примножувалась», але щось як я її вдягаю, то любов якось викликає таксі і більше не вертається."
    St "Значить, то така любов."
    Iv "Еге ж. До етапу зачарованих на любов трусів досі ніхто не дійшов."

    menu:
        "Мабуть, то на краще":
            call change_luck_points(-5)
            Iv "Навіть не знаю. Мені хотілось хоч раз їх комусь показати."
            Iv "Хоча… А ні, забудь."
        "Ніколи не бачив панталонну магію":
            call change_luck_points(+5)
            Iv "Це дуже легко виправити."

    # Ілюстрація Ів сильно посміхається і дивиться на співрозмовника
    St "…"
    St "Що таке? У мене кров на вусах лишилась?"
    Iv "…"
    Iv "Ти такий милий."
    St "Здається, хтось вже п’яненький."
    Iv "Пф, від чого? Не сміши."
    Iv "От від Клода я можу вийти трохи під градусом, але зараз ні в одному оці."
    Iv "…"
    Iv "Ти любиш адреналін?"
    St "Гм… Залежить від способу його отримання."
    St "Щось небезпечне для життя я не роблю, але залізти на якусь багатоповерхівку – це цікаво."
    Iv "Каже упирчик, який принципово не виходить в двері, а стрибає у вікна."
    St "Це абсолютно безпечно."
    St "Ну, для мене так точно."
    St "А що?"
    # Ілюстрація №2 Ів сильно посміхається і дивиться на співрозмовника
    Iv "…"
    Iv "Ти такий цікавий горішок."
    Iv "Іноді мені здається, що я тебе розкусив, зрозумів, що у тебе всередині, а потім виявляється, що нічого подібного."
    Iv "Так цікаво."
    Iv "Цікаво намацувати твої кордони. В усьому."
    St "Це взаємно."
    St "Близьким людям я дозволяю… дуже багато."
    Iv "…"
    St "…"
    St "Давай, бо я ж бачу, як воно тебе мучить."
    # Ілюстрація №3 Ів сильно посміхається і дивиться на співрозмовника

    Iv "…"
    St "Хочеш промацувати не тільки емоційні кордони?"
    Iv "Ще раз повторю: ти такий милий."
    Iv "Проте так, ти все вірно підмітив."


    # Приховати екран з діалогами і лишити кілька Ілюстрація Ів сильно посміхається і дивиться на співрозмовника
    window hide

    St "Це що, твоя нога під столом?"
    Iv "Так. А має бути рука?"
    menu:
        "Я б не відмовився":
            call change_luck_points(+5)
            call change_cringe_points(+2)
        "Ніколи не бачив панталонну магію":
            call change_luck_points(-5)

    Iv "Не хвилюйся, я не зроблю нічого протизаконного."
    Iv "Чи ти хотів би?"
    St "Можливо."
    Iv "Але ми не будемо?"
    St "Не сьогодні."
    "Нога Іва дуже обережно торкається твоєї щиколотки, акуратно погладжуючи її кінчиками пальців."
    "Ти намагаєшся зосередитись на його словах, але тобі це погано вдається."
    Iv "Не напружуйся ти так."
    Iv "Дихай."
    "Ти швидко перевіряєш, чи не дивиться хтось у вашу сторону, але і персонал, і відвідувачі зайняті власними справами та розмовами."
    Iv "Чи може ти не любиш усілякі тактильні штуки, м?"

    menu:
        "Люблю, але не на людях":
            call change_luck_points(-5)
        "Люблю. І приймати, і віддавати":
            call change_luck_points(+5)

    Iv "Не хвилюйся."
    Iv "Я так, дражнюсь трошки."
    St "Та я і не хвилююсь. Просто спостерігаю."
    Iv "І як?"
    St "Цікаво."
    Iv "В цьому і є головний сенс подібних зустрічей, чи не так?"
    "Ів продовжує погладжувати твою ногу, проте встановлені власною совістю рамки не перетинає."
    "По твоєму тілу мимоволі пробігають приємні мурахи."

    # Ілюстрація зміна освітлення фону
    Iv "Оу. Час з тобою завжди летить так непомітно."
    St "Я теж здивований, що вже так пізно."
    St "Хочеш ще чогось? Кави, наприклад?"
    Iv "Ні, дякую. Я ситий, напитий і наговорений."
    Iv "Наступного разу я ж обираю місце зустрічі?"
    St "Так."
    Iv "Тоді покажу тобі, де я раніше любив проводити час годинами."
    St "Чому «любив»?"
    Iv "Переїхав."
    St "Зрозумів. Добре, мені вже дуже цікаво, де це."
    Iv "Багато не…"
    # Ілюстрація зміна фону і починається шум
    Iv "Дідько, а що так голосно?"
    Iv "Гр-р-р!"
    Iv "Намагаються вигнати всіх перевертнів чи що?"
    St "Не зрозумів."
    Iv "Вуха чутливі до звуків навіть у людській формі. Я і так чую, як на кухні дехто після нарізки салату руки не помив і взявся ними на за м’ясо, а цей концерт взагалі мене вбиває."
    St "Підемо звідси?"
    Iv "Так, пора йти. І так довго просиділи, пора іти відсипатись перед новим робочим днем."
    St "А у мене завтра вихідний."
    Iv "Радий за тебе, але не від щирого серця."
    "До вас підходить офіціант і ви просите його принести розділений рахунок."
    # Ілюстрація Ів гордо дістає телефон з монобанком на фоні

    Iv "Мені сьогодні як раз мали заплатити за останній проєкт, тож гуляєм на всі."
    Iv "Тільки трошки на метро лишити треба."

    menu:
        "Оплатити свою частину чеку":
            pass

    # Ілюстрація пікання телефона
    St "Метро спільними зусиллями ми точно подолаємо."
    Iv "Тепер я."
    # Ілюстрація пікання телефона і звук відмови
    Of "Оплата не проходить. Спробуйте ще раз."
    Iv "Ем-м-м… Ну добре."
    St "Якщо що…"
    Iv "Все добре."
    # Ілюстрація пікання телефона і звук відмови
    Iv "От чортівня! Мабуть, замовник таки ще не оплатив проєкт."
    Iv "Нічого, нічого. У мене є готівка."
    Iv "Зараз, кілька секунд."
    # Ілюстрація з гаманцем
    St "…"
    Iv "Монетки теж гроші!"
    St "Тобі точно не потрібна допомога?"
    Iv "Взагалі жодних проблем. Тільки у замовника, якого завтра чекає невеличкий скандал."
    Iv "Нарешті позбавлюсь від цієї дрібноти. Так, скільки там по рахунку?"
    St "Ти зараз схожий на дракона, який сидить на купі золота і нікого до неї не підпускає."
    Iv "Ти дивись, а то ще почують і потім десь за рогом популярно нам пояснять, чому подібні стереотипи шкодять їм у реальному житті."
    St "Цікаве вийде закінчення дня."
    Iv "У тебе є знайомі травматологи?"
    St "Звісно є, але я б не хотів потрапити до них на прийом. Вчились вони так собі."
    Iv "Тепер і мені треба контакти, щоб точно до них не потрапити."
    Iv "Тридцять чотири, тридцять п’ять… А стоп! Чи ні, не стоп… Все заново."
    Iv "Не дивись так на мене!"
    St "Та хоч три години рахуй свої гроші, я нікуди не спішу. І вуха у мене не болять."
    Iv "…"
    St "…"
    # Ілюстрація з піснею на беку
    Iv "Десять… Двадцять…"
    Iv "Чому ти так на мене дивишся?"
    St "Просто цікаво, що буде, якщо я зараз повторю твої дії кілька хвилин тому."
    Iv "Тоді ми звідси ніколи не вийдемо."
    Iv "Так, не заважай. Або заважай, але через пару хвилин."
    Iv "…"
    Iv "П’ятдесят три… Ага…"
    Iv "Тридцять… Сорок… Все! Ну от, жодних проблем!"
    St "Можна подумати, що ти пограбував якогось волоцюгу."
    Iv "О, маю на цю тему прикольну історію! Зараз розповім…"
    Iv "Йдемо?"

    menu:
        "Так":
            pass

    jump end_game_transition










label the_end_cringe:
    # Анімація
    "(CRENGE END)"
    jump end_game_transition

label the_end_2:
    Iv "Я слухаю. А… Так… Угу…"
    Iv "Ні, я… Так. Так. Так. Ні. Так. А… Ні."
    Iv "Я можу завтра."
    Iv "В сенсі? Чому?"
    Iv "Добр… "
    # Ілюстрація схарений Ів прибирає телефон від вуха
    Iv "Ох."
    Iv "Мабуть…"
    Iv "…"
    Iv "Добре. До десятої."
    Iv "…"
    # Ілюстрація дуже сумний Ів без телефона
    St "Щось сталось?"
    Iv "Замовник дзвонив. Хоче отримати готову роботу от прямо зараз і не секундою пізніше."
    St "А то що?"
    Iv "А то буду я харчуватись пацюками з каналізації, а не продуктами з супермаркета."
    St "Не заплатить?"
    Iv "Не заплатить."
    St "Я зрозумів. Нічого страшного, значить, сьогодні закінчимо раніше."
    Iv "Пройдешся зі мною до зупинки?"
    St "Звісно. Як я можу тобі відмовити?"
    Iv "Я навіть можу понести твою парасолю."
    St "Тоді мені доведеться понести тебе."
    Iv "Я не проти."
    St "Та я, насправді, теж."
    jump end_game_transition

label the_end_3:
    "TODO: THE END 3"
    jump end_game_transition


label end_game_transition:
    "(END)"
    return